### Simple example showing how to query a MySql db and examine the results.
#### Prepared by Dr. Kalpakis for CMSC461@UMBC (Spring'2019)

In [4]:
#!pip install mysql-connector-python

In [1]:
import mysql.connector

In [3]:
# get DB username and password from the standard input
import getpass
db_user = 'root'
db_password = 'password'

In [4]:
# prepare the configuration parameters for connecting to database
config = {
   'user': db_user,
   'password': db_password,
   'host': 'localhost',
   'port': 3306,
   'database': 'university',
   'raise_on_warnings': True                    
}

In [5]:
#connect to DB server
db_connection = mysql.connector.connect(**config)

In [6]:
#open a cursor (iterator) for stepping through the tuples in the resultset of an SQL query 
cur = db_connection.cursor()

In [7]:
query = ("SELECT name, dept_name FROM student LIMIT 10")

# execute the query
cur.execute(query)

#iterate over the resultset
for (name, dept_name) in cur:
    print("{:15} {:10}".format(name, dept_name))

Zhang           Comp. Sci.
Shankar         Comp. Sci.
Brandt          History
Chavez          Finance
Peltier         Physics
Levy            Physics
Williams        Comp. Sci.
Sanchez         Music
Snow            Physics
Brown           Comp. Sci.

In [8]:
#close the cursor
cur.close()

True

In [9]:
# get the result set of an SQL query statement as a panda dataframe
import pandas as pd
df = pd.read_sql('SELECT name, dept_name FROM student', con=db_connection)
#show the first 10 tuples in the result set
df.head(10)

       name   dept_name
0     Zhang  Comp. Sci.
1   Shankar  Comp. Sci.
2    Brandt     History
3    Chavez     Finance
4   Peltier     Physics
5      Levy     Physics
6  Williams  Comp. Sci.
7   Sanchez       Music
8      Snow     Physics
9     Brown  Comp. Sci.

In [10]:
#close the connection to the DB server
db_connection.close()

In [11]:
#capture host information
import datetime
print(datetime.datetime.now())
!whoami
!hostname
#!ipconfig | grep 'IPv4 Address'
#!ipconfig | grep 'DNS'
!ipconfig
%connect_info

2019-02-12 22:15:01.668056
rob
rob-BOXE
/bin/sh: 1: ipconfig: not found
{
  "shell_port": 52253,
  "iopub_port": 35867,
  "stdin_port": 43159,
  "control_port": 35089,
  "hb_port": 42445,
  "ip": "127.0.0.1",
  "key": "6dc4f3a8-b8a225b767944fc2b92b60fc",
  "transport": "tcp",
  "signature_scheme": "hmac-sha256",
  "kernel_name": ""
}

Paste the above JSON into a file, and connect with:
    $> jupyter <app> --existing <file>
or, if you are local, you can connect with just:
    $> jupyter <app> --existing kernel-526b1637-7f7c-4dd7-987b-84ef7ed55d98.json
or even just:
    $> jupyter <app> --existing
if this is the most recent Jupyter kernel you have started.